2827700630/ADS8688-STM32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

// 定时器中断采样相关函数声明
void ADS8688_SetSamplingEnabled(uint8_t enable);
uint32_t ADS8688_GetSampleCount(void);
void ADS8688_ResetSampleCount(void);

// 历史记录相关函数声明
uint16_t ADS8688_GetHistoryData(uint8_t channel, uint16_t index);
uint16_t ADS8688_GetHistoryIndex(void);
uint16_t ADS8688_GetHistoryCount(void);
void ADS8688_ClearHistory(void);
uint16_t ADS8688_GetRecentHistoryData(uint8_t channel, uint16_t *data, uint16_t count);

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_Pin GPIO_PIN_13
#define LED_GPIO_Port GPIOC
#define ADS8688_RST_Pin GPIO_PIN_0
#define ADS8688_RST_GPIO_Port GPIOB
#define ADS8688_CS_Pin GPIO_PIN_1
#define ADS8688_CS_GPIO_Port GPIOB
#define ADS8688_REFSEL_Pin GPIO_PIN_10
#define ADS8688_REFSEL_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
